RepXcel/nRF52832-Embedded-Application/src/main.c
#define DEAD_BEEF                           0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define OSTIMER_WAIT_FOR_QUEUE              2                                       /**< Number of ticks to wait for the timer queue to be ready */

#define WORKOUT_DATA_NOTIFICATION_INTERVAL  300                                      /**< Notification update interval */

#define TWI_INSTANCE_ID                     0                                       /**< I2C driver instance */
#define MAX_PENDING_TRANSACTIONS            32                                      /**< Maximal number of pending I2C transactions */
#define ACCEl_BUFFER_SIZE                   17                                      /**< Buffer size */
#define ACCEL_PERIOD                        1.0f/200.0f                             /**< Accel sampling period */
#define ACCEL_ERROR_THRESHOLD               150.0f                                  /**< Values below threshold will be treated as negligible acceleration*/
#define ACCEL_SAMPLE_TOLERANCE              5                                       /**< Number of samples to use for velocity when valid sample is detected*/
#define REP_VELOCITY_MINIMUM                35.0f                                   /**< Minimum velocity for rep tracking*/         
#define REP_VELOICTY_MOVING_THRESHOLD       24                                      /**< Number of samples for a valid rep */

#define MG_TO_MMPSS(MG)                     (MG) * 9.81f                            /**< Converts from mg to mm/s^2 (centimeters per second)*/

#define LIS2DH12_INT1                       25                                      /**< nRF52 Pin for LIS2DH12 INT1 */
#define LIS2DH12_INT2                       26                                      /**< nRF52 Pin for LIS2DH12 INT2 */
#define LIS2DH12_CS                         27                                      /**< nRF52 Pin for LIS2DH12 CS */
#define LIS2DH12_SA0                        28                                      /**< nRF52 Pin for LIS2DH12 SA0 */
#define LIS2DH12_SDA                        29                                      /**< nRF52 Pin for LIS2DH12 SDA */
#define LIS2DH12_SCL                        30                                      /**< nRF52 Pin for LIS2DH12 SCL */

/**@brief Macro to convert the result of ADC conversion in millivolts.
 *
 * @param[in]  ADC_VALUE   ADC result.
 *
 * @retval     Result converted to millivolts.
 */
#define ADC_RESULT_IN_MILLI_VOLTS(ADC_VALUE)\
        ((((ADC_VALUE) * ADC_REF_VOLTAGE_IN_MILLIVOLTS) / ADC_RES_10BIT) * ADC_PRE_SCALING_COMPENSATION)

#define ADC_REF_VOLTAGE_IN_MILLIVOLTS   600                                     /**< Reference voltage (in milli volts) used by ADC while doing conversion. */
#define ADC_PRE_SCALING_COMPENSATION    6                                       /**< The ADC is configured to use VDD with 1/3 prescaling as input. And hence the result of conversion is to be multiplied by 3 to get the actual value of the battery voltage.*/
#define DIODE_FWD_VOLT_DROP_MILLIVOLTS  270                                     /**< Typical forward voltage drop of the diode . */
#define ADC_RES_10BIT                   1024                                    /**< Maximum digital value for 10-bit ADC conversion. */

/* Device states for rep veloicty state machine */
typedef enum                                                                        
{
    REST,                                                                           /**< Device not in motion, rep velocity not updated */
    BEGIN_MOVING,                                                                   /**< Device in motion, rep velocity not updated */
    MOVING,                                                                         /**< Device in motion, rep veloicty is updated */
} device_state_t;

BLE_BAS_DEF(m_bas);                                                                 /**< Battery service instance. */
BLE_HRS_DEF(m_hrs);                                                                 /**< Heart rate service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
NRF_TWI_MNGR_DEF(m_nrf_twi_mngr, MAX_PENDING_TRANSACTIONS, TWI_INSTANCE_ID);        /**< TWI manager instance. */
NRF_TWI_SENSOR_DEF(m_nrf_twi_sensor, &m_nrf_twi_mngr, ACCEl_BUFFER_SIZE);           /**< TWI sensor instance. */
LIS2DH12_INSTANCE_DEF(m_lis2dh12, &m_nrf_twi_sensor, LIS2DH12_BASE_ADDRESS_HIGH);   /**< LIS2DH12 accel instance. */
BLE_WORKOUT_DATA_DEF(m_workout_data);

static uint16_t         m_conn_handle = BLE_CONN_HANDLE_INVALID;                    /**< Handle of the current connection. */
static lis2dh12_data_t  m_accel_data[ACCEl_BUFFER_SIZE] = {0};                      /**< Buffer for accel samples */
static uint8_t          m_samples_to_read[3] = {0};                                 /**< Number of samples to read on each axis (x,y,z)*/
static bool             m_data_ready = false;                                       /**< Data ready flag*/  
static device_state_t   m_device_state = REST;                                      /**< Device state for rep velocity tracking*/  
static float            m_velocity;                                                 /**< Current device velocity (magnitude)*/
static workout_data_t   m_rep_velocity = {0};                                       /**< Device state for rep velocity tracking*/  

static nrf_saadc_value_t adc_buf[2];                                                /**< SAADC buffer */

static ble_uuid_t m_adv_uuids[] = {                                                 /**< Universally unique service identifiers. */
    {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE},
};

static ble_uuid_t m_sr_uuids[] = {
    {CUSTOM_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}                               /**< Universally unique service identifiers. */
};

static TimerHandle_t m_battery_timer;                                               /**< Definition of battery timer. */
static TimerHandle_t m_ble_workout_data_notif_timer;                                /**< Definition of notification timer. */

#if NRF_LOG_ENABLED
static TaskHandle_t m_logger_thread;                                                /**< Definition of Logger thread. */
#endif
static TaskHandle_t m_accel_thread;                                                 /**< Definition of Accel thread. */
static TaskHandle_t m_rep_velocity_thread;                                          /**< Definition of Per Rep Velocity thread. */

static void advertising_start(void * p_erase_bonds);

static void accel_on(void){
    ret_code_t err_code;
    LIS2DH12_DATA_CFG(m_lis2dh12, LIS2DH12_ODR_200HZ, false, true, true, true, LIS2DH12_SCALE_2G, true);
    LIS2DH12_FIFO_CFG(m_lis2dh12, true, LIS2DH12_STREAM, false, ACCEl_BUFFER_SIZE);
    LIS2DH12_INT1_PIN_CFG(m_lis2dh12, false, false, false, false, true, false, true, false);
    LIS2DH12_FILTER_CFG(m_lis2dh12, LIS2DH12_FILTER_MODE_NORMAL, LIS2DH12_FILTER_FREQ_1, true, false, false, false);
    err_code = lis2dh12_cfg_commit(&m_lis2dh12);
    
    APP_ERROR_CHECK(err_code);
}

