RepXcel/nRF52832-Embedded-Application/src/main.c
static void accel_off(void){
    ret_code_t err_code;
    LIS2DH12_DATA_CFG(m_lis2dh12, LIS2DH12_ODR_POWERDOWN, false, true, true, true, LIS2DH12_SCALE_2G, true);
    err_code = lis2dh12_cfg_commit(&m_lis2dh12);
    
    APP_ERROR_CHECK(err_code);
}

static void update_velocity(void){
    static float velocity_xyz[3] = {0};
    float accel_magnitude_mmpss[3];

    for (uint8_t i = 0; i < ACCEl_BUFFER_SIZE; i++){
        accel_magnitude_mmpss[0] = MG_TO_MMPSS(m_accel_data[i].x >> 4);
        accel_magnitude_mmpss[1] = MG_TO_MMPSS(m_accel_data[i].y >> 4);
        accel_magnitude_mmpss[2] = MG_TO_MMPSS(m_accel_data[i].z >> 4);
        for(uint8_t i = 0; i < sizeof(accel_magnitude_mmpss) / sizeof(float); i++){
            if (abs(accel_magnitude_mmpss[i]) > ACCEL_ERROR_THRESHOLD) {
                m_samples_to_read[i] = ACCEL_SAMPLE_TOLERANCE;
            }
            if(m_samples_to_read[i]){
                velocity_xyz[i] += accel_magnitude_mmpss[i] * ACCEL_PERIOD;
            } else {
                velocity_xyz[i] = 0;
            }
            m_samples_to_read[i] = MAX(m_samples_to_read[i] - 1, 0);
        }
        m_velocity = sqrt(velocity_xyz[0] * velocity_xyz[0] + velocity_xyz[1] * velocity_xyz[1] + velocity_xyz[2] * velocity_xyz[2]);
        UNUSED_RETURN_VALUE(vTaskResume(m_rep_velocity_thread));
        NRF_LOG_INFO("Rep Velocity: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(m_velocity));
        NRF_LOG_INFO("Rep state %d, Rep Velocity: " NRF_LOG_FLOAT_MARKER, m_device_state, NRF_LOG_FLOAT(m_rep_velocity.data.velocity));
        // NRF_LOG_INFO("Rep accel X: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(accel_magnitude_mmpss[0]));
        // NRF_LOG_INFO("Rep accel Y: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(accel_magnitude_mmpss[1]));
        // NRF_LOG_INFO("Rep accel Z: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(accel_magnitude_mmpss[2]));
        // NRF_LOG_INFO("Rep Velocity X: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(velocity_xyz[0]));
        // NRF_LOG_INFO("Rep Velocity Y: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(velocity_xyz[1]));
        // NRF_LOG_INFO("Rep Velocity Z: " NRF_LOG_FLOAT_MARKER, NRF_LOG_FLOAT(velocity_xyz[2]));
    }
}

static void accel_thread(void * arg)
{
    UNUSED_PARAMETER(arg);
    ret_code_t err_code;
    for(;;) {
        __WFI();
        if(m_data_ready) {
            err_code = lis2dh12_data_read(&m_lis2dh12, NULL, m_accel_data, ACCEl_BUFFER_SIZE);
            APP_ERROR_CHECK(err_code);
            update_velocity();
            bsp_board_led_off(BSP_BOARD_LED_1);
            m_data_ready = false;
        }
    }
}

static void rep_velocity_thread(void  * arg){
    UNUSED_PARAMETER(arg);
    ret_code_t err_code;
    uint32_t sample_count = 0;
    float temp_rep_velocity = 0;
    for(;;)
    {
        switch(m_device_state){
            case REST:
            if(m_velocity >= REP_VELOCITY_MINIMUM){
                temp_rep_velocity = 0;
                sample_count = 0;
                temp_rep_velocity = m_velocity;
                m_device_state = BEGIN_MOVING;
            }
            break;

            case BEGIN_MOVING:
            if(m_velocity < REP_VELOCITY_MINIMUM){
                m_device_state = REST;
            } else if(sample_count == REP_VELOICTY_MOVING_THRESHOLD){
                m_device_state = MOVING;
            }
            temp_rep_velocity = MAX(temp_rep_velocity, m_velocity);
            sample_count++;
            break;

            case MOVING:
            if(m_velocity == 0){
                m_rep_velocity.data.velocity = temp_rep_velocity;
                m_rep_velocity.data.timestamp += 1;
                m_device_state = REST;
            }
            temp_rep_velocity = MAX(temp_rep_velocity, m_velocity); 
            break;

            default:
            break;
        }
        vTaskSuspend(NULL);
    }
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    bool delete_bonds = false;

    pm_handler_on_pm_evt(p_evt);
    pm_handler_disconnect_on_sec_failure(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(&delete_bonds);
            break;

        default:
            break;
    }
}

/**@brief Function for handling the ADC interrupt.
 *
 * @details  This function will fetch the conversion result from the ADC, convert the value into
 *           percentage and send it to peer.
 */
void saadc_event_handler(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        nrf_saadc_value_t adc_result;
        uint16_t          batt_lvl_in_milli_volts;
        uint8_t           percentage_batt_lvl;
        uint32_t          err_code;

        adc_result = p_event->data.done.p_buffer[0];

        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, 1);
        APP_ERROR_CHECK(err_code);

        batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(adc_result) +
                                  DIODE_FWD_VOLT_DROP_MILLIVOLTS;
        percentage_batt_lvl = battery_level_in_percent(batt_lvl_in_milli_volts);

        err_code = ble_bas_battery_level_update(&m_bas, percentage_batt_lvl, BLE_CONN_HANDLE_ALL);
        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_BUSY) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
           )
        {
            APP_ERROR_HANDLER(err_code);
        }
        // NRF_LOG_INFO("Battery percent: %d", percentage_batt_lvl);
    }
}

/**@brief Function for configuring ADC to do battery level conversion.
 */
static void adc_configure(void)
{
    ret_code_t err_code = nrf_drv_saadc_init(NULL, saadc_event_handler);
    APP_ERROR_CHECK(err_code);

    nrf_saadc_channel_config_t config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_VDD);
    err_code = nrf_drv_saadc_channel_init(0, &config);
    APP_ERROR_CHECK(err_code);

