RepXcel/nRF52832-Embedded-Application/src/main.c
    err_code = nrf_drv_saadc_buffer_convert(&adc_buf[0], 1);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(&adc_buf[1], 1);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *          This function will start the ADC.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code;
    err_code = nrf_drv_saadc_sample();
    APP_ERROR_CHECK(err_code);
}

static void workout_data_notification_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    ret_code_t err_code;
    err_code = ble_workout_data_value_update(&m_workout_data, m_rep_velocity);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
    m_ble_workout_data_notif_timer = xTimerCreate("WKT", WORKOUT_DATA_NOTIFICATION_INTERVAL, pdTRUE, NULL, workout_data_notification_timeout_handler);
    m_battery_timer = xTimerCreate("BATT", BATTERY_LEVEL_MEAS_INTERVAL, pdTRUE, NULL, battery_level_meas_timeout_handler);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_COMPUTER);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module. */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void on_workout_data_evt(ble_workout_data_t * p_workout_data_service, ble_workout_data_evt_t * p_evt)
{
    BaseType_t xReturn;
    switch(p_evt->evt_type)
    {
        case BLE_WORKOUT_DATA_EVT_NOTIFICATION_ENABLED:
            NRF_LOG_INFO("WORKOUT EVENT: NOTIF ENABLED");
            xReturn = xTimerStart(m_ble_workout_data_notif_timer, OSTIMER_WAIT_FOR_QUEUE);
            if (xReturn != pdPASS) {
                    APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
            }
            accel_on();
            memset(&m_rep_velocity, 0, sizeof(workout_data_t));
            break;

        case BLE_WORKOUT_DATA_EVT_NOTIFICATION_DISABLED:
            NRF_LOG_INFO("WORKOUT EVENT: NOTIF DISABLED");
            xReturn = xTimerStop(m_ble_workout_data_notif_timer, OSTIMER_WAIT_FOR_QUEUE);
            if (xReturn != pdPASS) {
                    APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
            }
            accel_off();
            break;

        case BLE_WORKOUT_DATA_EVT_CONNECTED:
            NRF_LOG_INFO("WORKOUT EVENT: CONNECTED");
            break;

        case BLE_WORKOUT_DATA_EVT_DISCONNECTED:
            NRF_LOG_INFO("WORKOUT EVENT: DISCONNECTED");
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the Heart Rate, Battery and Device Information services.
 */
static void services_init(void)
{
    ret_code_t err_code;
    ble_bas_init_t bas_init                     = {0};
    ble_dis_init_t dis_init                     = {0};
    nrf_ble_qwr_init_t qwr_init                 = {0};
    ble_workout_data_init_t workout_data_init   = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.

    // Here the sec level for the Battery Service can be changed/increased.
    bas_init.bl_rd_sec        = SEC_OPEN;
    bas_init.bl_cccd_wr_sec   = SEC_OPEN;
    bas_init.bl_report_rd_sec = SEC_OPEN;

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Device Information Service.
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)MANUFACTURER_NAME);

    dis_init.dis_char_rd_sec = SEC_OPEN;

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);


